day1/load_testing/logs/sync_sleep_0/thin/siege_test_case_01.log
** SIEGE 4.1.7
** Preparing 30 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		    79006    hits
Availability:		      100.00 %
Elapsed time:		       10.95 secs
Data transferred:	        3.77 MB
Response time:		        4.13 ms
Transaction rate:	     7215.16 trans/sec
Throughput:		        0.34 MB/sec
Concurrency:		       29.79
Successful transactions:    79006
Failed transactions:	        0
Longest transaction:	      130.00 ms
Shortest transaction:	        0.00 ms
 
p/0
** SIEGE 4.1.7
** Preparing 40 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		    88038    hits
Availability:		      100.00 %
Elapsed time:		       10.96 secs
Data transferred:	        4.20 MB
Response time:		        4.96 ms
Transaction rate:	     8032.66 trans/sec
Throughput:		        0.38 MB/sec
Concurrency:		       39.82
Successful transactions:    88038
Failed transactions:	        0
Longest transaction:	       90.00 ms
Shortest transaction:	        0.00 ms
 
200     0.00 secs:      50 bytes ==> GET  /sync_sleep/0
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		    87821    hits
Availability:		      100.00 %
Elapsed time:		       10.96 secs
Data transferred:	        4.19 MB
Response time:		        6.22 ms
Transaction rate:	     8012.86 trans/sec
Throughput:		        0.38 MB/sec
Concurrency:		       49.81
Successful transactions:    87821
Failed transactions:	        0
Longest transaction:	      130.00 ms
Shortest transaction:	        0.00 ms
 
 ==> GET  /sync_sleep/0