day1/load_testing/logs/sync_sleep_0/thin/siege_test_case_02.log
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		   467402    hits
Availability:		      100.00 %
Elapsed time:		       60.28 secs
Data transferred:	       22.29 MB
Response time:		        6.43 ms
Transaction rate:	     7753.85 trans/sec
Throughput:		        0.37 MB/sec
Concurrency:		       49.84
Successful transactions:   467402
Failed transactions:	        0
Longest transaction:	      140.00 ms
Shortest transaction:	        0.00 ms
 
1.1 200     0.00 secs:      50 bytes ==> GET  /sync_sleep/0